# Compound Structure Set Material Id Method

Source: https://www.revitapidocs.com/2026/19cb546b-1c9b-f658-7a66-4206af0b4b80.htm

---

| Compound Structure Set Material Id Method |
| --- |

Sets a material element for a specified layer.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetMaterialId(
	int layerIdx,
	ElementId materialId
)
```

```
Public Sub SetMaterialId (
	layerIdx As Integer,
	materialId As ElementId
)
```

```
public:
void SetMaterialId(
	int layerIdx,
	ElementId^ materialId
)
```

```
member SetMaterialId :
        layerIdx : int *
        materialId : ElementId -> unit
```

#### Parameters

layerIdx Int32
:   Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

materialId ElementId
:   The ElementId of a Material element.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The layer index is out of range. |

Remarks It is not verified that materialId corresponds to a valid Material element. See Also

#### Reference

CompoundStructure Class Autodesk.Revit.DB Namespace